moyoulingsen/shiyanshianquan/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_CAMERA_SC2336=y
CONFIG_CAM_CTRL_SPI_ENABLE=n
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_250M=y
CONFIG_LABGUARD_SENSOR_I2C_PORT=1
CONFIG_LABGUARD_SENSOR_I2C_ENABLE=y
CONFIG_LABGUARD_SENSOR_I2C_SDA_GPIO=2
CONFIG_LABGUARD_SENSOR_I2C_SCL_GPIO=3
CONFIG_LABGUARD_MQ2_ACTIVE_LOW=y
CONFIG_LABGUARD_ACTUATOR_LIGHT_GPIO=32
CONFIG_LABGUARD_ACTUATOR_LIGHT_DATA_GPIO=33
CONFIG_LABGUARD_ACTUATOR_LIGHT_LED_COUNT=8
CONFIG_LABGUARD_AUDIO_PROMPT_I2S_WS_GPIO=22

# SC2336 native 1024x600 RAW8 matches the EK79007 panel and camera pipeline.
CONFIG_CAMERA_SC2336_MIPI_RAW8_1024X600_30FPS=y
CONFIG_CAMERA_SC2336_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
